stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_radio.h
/**
  ******************************************************************************
  * @file    stm32wb0x_ll_radio.h
  * @author  GPM WBL Application Team
  * @brief   Header file of RADIO module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32WB0x_LL_RADIO_H
#define STM32WB0x_LL_RADIO_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32wb0x.h"

/** @addtogroup STM32WB0x_LL_Driver
  * @{
  */

/** @addtogroup RADIO
  * @{
  */


/** @defgroup RADIO_Exported_Macros RADIO Exported Macros
  * @{
  */

#define BLUEGLOB_BASE               (_MEMORY_RAM_BEGIN_ + 0xC0U)
#define BLUEGLOB                    ((GLOBALSTATMACH_TypeDef*) BLUEGLOB_BASE)
#define BLUEGLOBWORD                ((GLOBALSTATMACH_WORD_TypeDef*) BLUEGLOB_BASE)
#define bluedata                    ((STATMACH_TypeDef*) (BLUEGLOB_BASE+sizeof(GLOBALSTATMACH_TypeDef)))
#define BLUEDATAWORD                ((STATMACH_WORD_TypeDef*) (BLUEGLOB_BASE+sizeof(GLOBALSTATMACH_WORD_TypeDef)))
#define BlueTransStruct             TXRXPACK_TypeDef

#define BLUE_DATA_PTR_CAST(PTR) (((uint32_t)(uintptr_t)(PTR)))
#define BLUE_STRUCT_PTR_CAST(PTR) (((uint32_t)(uintptr_t)(PTR)))

/**
  * @}
  */


/** @defgroup RADIO_Exported_Constants RADIO Exported Constants
  *@{
  */

/* Hot table size */
#if defined(STM32WB05) || defined(STM32WB09)
#define HOT_TABLE_SIZE 37
#endif /* defined(STM32WB05) || defined(STM32WB09) */
#if defined(STM32WB06) || defined (STM32WB07)
#define HOT_TABLE_SIZE 31
#endif /* defined(STM32WB06) || defined (STM32WB07) */

/* RRM register address for the hot table */
#define RRM_CBIAS1_ANA_ENG      (0x5E)
#define RRM_CBIAS0_ANA_ENG      (0x5D)
#define RRM_RXADC_ANA_USR       (0x52)
#define RRM_AFC1_DIG_ENG        (0x12)
#define RRM_CR0_DIG_ENG         (0x15)
#define RRM_CR0_LR              (0x1A)
#define RRM_LR_RSSI_THR_DIG_ENG (0x22)
#define RRM_LR_PD_THR_DIG_ENG   (0x21)
#define RRM_LR_AAC_THR_DIG_ENG  (0x23)
#define RRM_VIT_CONF_DIG_ENG    (0x1B)
#define RRM_ANTSW_DIG0_USR      (0x90)
#define RRM_ANTSW_DIG1_USR      (0x91)


/** @defgroup GlobalStatmach_Masks GlobalStatmach Masks
  * @{
  */
#define GLOBAL_WORD0_RADIOCONFIGPTR_Pos                                    (0UL)
#define GLOBAL_WORD0_RADIOCONFIGPTR_Msk                                    (0xffffffffUL)
#define GLOBAL_WORD0_RADIOCONFIGPTR                                        GLOBAL_WORD0_RADIOCONFIGPTR_Msk
#define GLOBAL_WORD1_CURSTMACHNUM_Pos                                      (0UL)
#define GLOBAL_WORD1_CURSTMACHNUM_Msk                                      (0x7fUL)
#define GLOBAL_WORD1_CURSTMACHNUM                                          GLOBAL_WORD1_CURSTMACHNUM_Msk
#define GLOBAL_WORD1_ACTIVE_Pos                                            (7UL)
#define GLOBAL_WORD1_ACTIVE_Msk                                            (0x80UL)
#define GLOBAL_WORD1_ACTIVE                                                GLOBAL_WORD1_ACTIVE_Msk
#define GLOBAL_WORD1_WAKEUPINITDELAY_Pos                                   (8UL)
#define GLOBAL_WORD1_WAKEUPINITDELAY_Msk                                   (0xff00UL)
#define GLOBAL_WORD1_WAKEUPINITDELAY                                       GLOBAL_WORD1_WAKEUPINITDELAY_Msk
#define GLOBAL_WORD1_TIMER12INITDELAYCAL_Pos                               (16UL)
#define GLOBAL_WORD1_TIMER12INITDELAYCAL_Msk                               (0xff0000UL)
#define GLOBAL_WORD1_TIMER12INITDELAYCAL                                   GLOBAL_WORD1_TIMER12INITDELAYCAL_Msk
#define GLOBAL_WORD1_TIMER2INITDELAYNOCAL_Pos                              (24UL)
#define GLOBAL_WORD1_TIMER2INITDELAYNOCAL_Msk                              (0xff000000UL)
#define GLOBAL_WORD1_TIMER2INITDELAYNOCAL                                  GLOBAL_WORD1_TIMER2INITDELAYNOCAL_Msk
#define GLOBAL_WORD2_TRANSMITCALDELAYCHK_Pos                               (0UL)
#define GLOBAL_WORD2_TRANSMITCALDELAYCHK_Msk                               (0xffUL)
#define GLOBAL_WORD2_TRANSMITCALDELAYCHK                                   GLOBAL_WORD2_TRANSMITCALDELAYCHK_Msk
#define GLOBAL_WORD2_TRANSMITNOCALDELAYCHK_Pos                             (8UL)
#define GLOBAL_WORD2_TRANSMITNOCALDELAYCHK_Msk                             (0xff00UL)
#define GLOBAL_WORD2_TRANSMITNOCALDELAYCHK                                 GLOBAL_WORD2_TRANSMITNOCALDELAYCHK_Msk
#define GLOBAL_WORD2_RECEIVECALDELAYCHK_Pos                                (16UL)
#define GLOBAL_WORD2_RECEIVECALDELAYCHK_Msk                                (0xff0000UL)
#define GLOBAL_WORD2_RECEIVECALDELAYCHK                                    GLOBAL_WORD2_RECEIVECALDELAYCHK_Msk
#define GLOBAL_WORD2_RECEIVENOCALDELAYCHK_Pos                              (24UL)
#define GLOBAL_WORD2_RECEIVENOCALDELAYCHK_Msk                              (0xff000000UL)
#define GLOBAL_WORD2_RECEIVENOCALDELAYCHK                                  GLOBAL_WORD2_RECEIVENOCALDELAYCHK_Msk
#define GLOBAL_WORD3_CONFIGENDDURATION_Pos                                 (0UL)
#define GLOBAL_WORD3_CONFIGENDDURATION_Msk                                 (0xffUL)
#define GLOBAL_WORD3_CONFIGENDDURATION                                     GLOBAL_WORD3_CONFIGENDDURATION_Msk
#define GLOBAL_WORD3_TXDATAREADYCHECK_Pos                                  (8UL)
#define GLOBAL_WORD3_TXDATAREADYCHECK_Msk                                  (0xff00UL)
#define GLOBAL_WORD3_TXDATAREADYCHECK                                      GLOBAL_WORD3_TXDATAREADYCHECK_Msk
#define GLOBAL_WORD3_TXDELAYSTART_Pos                                      (16UL)
#define GLOBAL_WORD3_TXDELAYSTART_Msk                                      (0xff0000UL)
#define GLOBAL_WORD3_TXDELAYSTART                                          GLOBAL_WORD3_TXDELAYSTART_Msk
#define GLOBAL_WORD3_TXDELAYEND_Pos                                        (24UL)
#define GLOBAL_WORD3_TXDELAYEND_Msk                                        (0x3f000000UL)
#define GLOBAL_WORD3_TXDELAYEND                                            GLOBAL_WORD3_TXDELAYEND_Msk
#define GLOBAL_WORD3_TIMECAPTURESEL_Pos                                    (30UL)
#define GLOBAL_WORD3_TIMECAPTURESEL_Msk                                    (0x40000000UL)
#define GLOBAL_WORD3_TIMECAPTURESEL                                        GLOBAL_WORD3_TIMECAPTURESEL_Msk
#define GLOBAL_WORD3_TIMECAPTURE_Pos                                       (31UL)
#define GLOBAL_WORD3_TIMECAPTURE_Msk                                       (0x80000000UL)
#define GLOBAL_WORD3_TIMECAPTURE                                           GLOBAL_WORD3_TIMECAPTURE_Msk
#define GLOBAL_WORD4_TXREADYTIMEOUT_Pos                                    (0UL)
#define GLOBAL_WORD4_TXREADYTIMEOUT_Msk                                    (0xffUL)
#define GLOBAL_WORD4_TXREADYTIMEOUT                                        GLOBAL_WORD4_TXREADYTIMEOUT_Msk
#define GLOBAL_WORD4_RCVTIMEOUT_Pos                                        (8UL)
#define GLOBAL_WORD4_RCVTIMEOUT_Msk                                        (0xfffff00UL)
#define GLOBAL_WORD4_RCVTIMEOUT                                            GLOBAL_WORD4_RCVTIMEOUT_Msk
#define GLOBAL_WORD5_CHKFLAGAUTOCLEARENA_Pos                               (2UL)
#define GLOBAL_WORD5_CHKFLAGAUTOCLEARENA_Msk                               (0x4UL)
#define GLOBAL_WORD5_CHKFLAGAUTOCLEARENA                                   GLOBAL_WORD5_CHKFLAGAUTOCLEARENA_Msk
#define GLOBAL_WORD5_INTNOACTIVELERROR_Pos                                 (23UL)
#define GLOBAL_WORD5_INTNOACTIVELERROR_Msk                                 (0x800000UL)
#define GLOBAL_WORD5_INTNOACTIVELERROR                                     GLOBAL_WORD5_INTNOACTIVELERROR_Msk
#define GLOBAL_WORD5_INTTXRXSKIP_Pos                                       (29UL)
#define GLOBAL_WORD5_INTTXRXSKIP_Msk                                       (0x20000000UL)
#define GLOBAL_WORD5_INTTXRXSKIP                                           GLOBAL_WORD5_INTTXRXSKIP_Msk
#define GLOBAL_WORD5_INTACTIVE2ERR_Pos                                     (30UL)
#define GLOBAL_WORD5_INTACTIVE2ERR_Msk                                     (0x40000000UL)
#define GLOBAL_WORD5_INTACTIVE2ERR                                         GLOBAL_WORD5_INTACTIVE2ERR_Msk
#if defined(STM32WB05) || defined(STM32WB09)
#define GLOBAL_WORD6_DEFAULTANTENNAID_Pos                                  (0UL)
#define GLOBAL_WORD6_DEFAULTANTENNAID_Msk                                  (0x7fUL)
#define GLOBAL_WORD6_DEFAULTANTENNAID                                      GLOBAL_WORD6_DEFAULTANTENNAID_Msk
#endif /* defined(STM32WB05) || defined(STM32WB09) */

#define GLOBAL_BYTE4_CURSTMACHNUM_Msk                                      (0x7F)
#define GLOBAL_BYTE4_ACTIVE_Msk                                            (0x80)

