stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_radio.h
#define GLOBAL_BYTE15_TXDELAYEND_Msk                                       (0x3F)
#define GLOBAL_BYTE15_TIMECAPTURESEL_Msk                                   (0x40)
#define GLOBAL_BYTE15_TIMECAPTURE_Msk                                      (0x80)

#define GLOBAL_BYTE20_AUTOTXRXSKIPEN_Msk                                   (0x01)
#define GLOBAL_BYTE20_CHKFLAGAUTOCLEARENA_Msk                              (0x04)

#define GLOBAL_BYTE21_INTSEQERROR_Msk                                      (0x3F)

#define GLOBAL_BYTE22_INTADDPOINTERROR_Msk                                 (0x10)
#define GLOBAL_BYTE22_INTALLTABLEREADYERROR_Msk                            (0x20)
#define GLOBAL_BYTE22_INTTXDATAREADYERROR_Msk                              (0x40)
#define GLOBAL_BYTE22_INTNOACTIVELERROR_Msk                                (0x80)

#define GLOBAL_BYTE23_INTRCVLENGTHERROR_Msk                                (0x02)
#define GLOBAL_BYTE23_INTSEMATIMEOUTERROR_Msk                              (0x04)
#define GLOBAL_BYTE23_INTSEMAWASPREEMPT_Msk                                (0x08)
#define GLOBAL_BYTE23_INTSEQDONE_Msk                                       (0x10)
#define GLOBAL_BYTE23_INTTXRXSKIP_Msk                                      (0x20)
#define GLOBAL_BYTE23_INTACTIVE2ERR_Msk                                    (0x40)
#define GLOBAL_BYTE23_INTCONFIGERROR_Msk                                   (0x80)

#if defined(STM32WB05) || defined(STM32WB09)
#define GLOBAL_BYTE24_DEFAULTANTENNAID_Msk                                 (0x7F)
#endif /* defined(STM32WB05) || defined(STM32WB09) */

/**
  * @}
  */


/** @defgroup Statmach_Masks Statmach Masks
  * @{
  */
#define STATEMACH_WORD0_UCHAN_Pos                                          (0UL)
#define STATEMACH_WORD0_UCHAN_Msk                                          (0x3fUL)
#define STATEMACH_WORD0_UCHAN                                              STATEMACH_WORD0_UCHAN_Msk
#define STATEMACH_WORD0_RADIOCOMLISTENA_Pos                                (6UL)
#define STATEMACH_WORD0_RADIOCOMLISTENA_Msk                                (0x40UL)
#define STATEMACH_WORD0_RADIOCOMLISTENA                                    STATEMACH_WORD0_RADIOCOMLISTENA_Msk
#define STATEMACH_WORD0_TXMODE_Pos                                         (7UL)
#define STATEMACH_WORD0_TXMODE_Msk                                         (0x80UL)
#define STATEMACH_WORD0_TXMODE                                             STATEMACH_WORD0_TXMODE_Msk
#define STATEMACH_WORD0_REMAP_CHAN_Pos                                     (8UL)
#define STATEMACH_WORD0_REMAP_CHAN_Msk                                     (0x3f00UL)
#define STATEMACH_WORD0_REMAP_CHAN                                         STATEMACH_WORD0_REMAP_CHAN_Msk
#define STATEMACH_WORD0_SN_Pos                                             (14UL)
#define STATEMACH_WORD0_SN_Msk                                             (0x4000UL)
#define STATEMACH_WORD0_SN                                                 STATEMACH_WORD0_SN_Msk
#define STATEMACH_WORD0_NESN_Pos                                           (15UL)
#define STATEMACH_WORD0_NESN_Msk                                           (0x8000UL)
#define STATEMACH_WORD0_NESN                                               STATEMACH_WORD0_NESN_Msk
#if defined(STM32WB09)
#define STATEMACH_WORD0_PHYSCHANPDUTYPE_Pos                                (16UL)
#define STATEMACH_WORD0_PHYSCHANPDUTYPE_Msk                                (0x30000UL)
#define STATEMACH_WORD0_PHYSCHANPDUTYPE                                    STATEMACH_WORD0_PHYSCHANPDUTYPE_Msk
#endif /* defined(STM32WB09) */
#define STATEMACH_WORD0_ENCRYPTON_Pos                                      (21UL)
#define STATEMACH_WORD0_ENCRYPTON_Msk                                      (0x200000UL)
#define STATEMACH_WORD0_ENCRYPTON                                          STATEMACH_WORD0_ENCRYPTON_Msk
#define STATEMACH_WORD0_TXPHY_Pos                                          (24UL)
#define STATEMACH_WORD0_TXPHY_Msk                                          (0x7000000UL)
#define STATEMACH_WORD0_TXPHY                                              STATEMACH_WORD0_TXPHY_Msk
#if defined(STM32WB05) || defined(STM32WB09)
#define STATEMACH_WORD0_CTEDISABLE_Pos                                     (27UL)
#define STATEMACH_WORD0_CTEDISABLE_Msk                                     (0x8000000UL)
#define STATEMACH_WORD0_CTEDISABLE                                         STATEMACH_WORD0_CTEDISABLE_Msk
#endif /* defined(STM32WB05) || defined(STM32WB09) */
#define STATEMACH_WORD0_RXPHY_Pos                                          (28UL)
#define STATEMACH_WORD0_RXPHY_Msk                                          (0x70000000UL)
#define STATEMACH_WORD0_RXPHY                                              STATEMACH_WORD0_RXPHY_Msk
#define STATEMACH_WORD1_TXPOINT_Pos                                        (0UL)
#define STATEMACH_WORD1_TXPOINT_Msk                                        (0xffffffffUL)
#define STATEMACH_WORD1_TXPOINT                                            STATEMACH_WORD1_TXPOINT_Msk
#define STATEMACH_WORD2_RCVPOINT_Pos                                       (0UL)
#define STATEMACH_WORD2_RCVPOINT_Msk                                       (0xffffffffUL)
#define STATEMACH_WORD2_RCVPOINT                                           STATEMACH_WORD2_RCVPOINT_Msk
#define STATEMACH_WORD3_TXPOINTPREV_Pos                                    (0UL)
#define STATEMACH_WORD3_TXPOINTPREV_Msk                                    (0xffffffffUL)
#define STATEMACH_WORD3_TXPOINTPREV                                        STATEMACH_WORD3_TXPOINTPREV_Msk
#define STATEMACH_WORD4_RCVPOINTPREV_Pos                                   (0UL)
#define STATEMACH_WORD4_RCVPOINTPREV_Msk                                   (0xffffffffUL)
#define STATEMACH_WORD4_RCVPOINTPREV                                       STATEMACH_WORD4_RCVPOINTPREV_Msk
#define STATEMACH_WORD6_PCNTTX_31_0_Pos                                    (0UL)
#define STATEMACH_WORD6_PCNTTX_31_0_Msk                                    (0xffffffffUL)
#define STATEMACH_WORD6_PCNTTX_31_0                                        STATEMACH_WORD6_PCNTTX_31_0_Msk
#define STATEMACH_WORD7_PCNTTX_39_32_Pos                                   (0UL)
#define STATEMACH_WORD7_PCNTTX_39_32_Msk                                   (0xffUL)
#define STATEMACH_WORD7_PCNTTX_39_32                                       STATEMACH_WORD7_PCNTTX_39_32_Msk
#define STATEMACH_WORD7_PCNTRCV_23_0_Pos                                   (8UL)
#define STATEMACH_WORD7_PCNTRCV_23_0_Msk                                   (0xffffff00UL)
#define STATEMACH_WORD7_PCNTRCV_23_0                                       STATEMACH_WORD7_PCNTRCV_23_0_Msk
#define STATEMACH_WORD8_PCNTRCV_39_24_Pos                                  (0UL)
#define STATEMACH_WORD8_PCNTRCV_39_24_Msk                                  (0xffffUL)
#define STATEMACH_WORD8_PCNTRCV_39_24                                      STATEMACH_WORD8_PCNTRCV_39_24_Msk
#define STATEMACH_WORD8_INTENCERROR_Pos                                    (29UL)
#define STATEMACH_WORD8_INTENCERROR_Msk                                    (0x20000000UL)
#define STATEMACH_WORD8_INTENCERROR                                        STATEMACH_WORD8_INTENCERROR_Msk
#define STATEMACH_WORD9_ACCADDR_Pos                                        (0UL)
#define STATEMACH_WORD9_ACCADDR_Msk                                        (0xffffffffUL)
#define STATEMACH_WORD9_ACCADDR                                            STATEMACH_WORD9_ACCADDR_Msk
#define STATEMACH_WORDA_CRCINIT_Pos                                        (0UL)
#define STATEMACH_WORDA_CRCINIT_Msk                                        (0xffffffUL)
#define STATEMACH_WORDA_CRCINIT                                            STATEMACH_WORDA_CRCINIT_Msk
#define STATEMACH_WORDA_MAXRECEIVEDLENGTH_Pos                              (24UL)
#define STATEMACH_WORDA_MAXRECEIVEDLENGTH_Msk                              (0xff000000UL)
#define STATEMACH_WORDA_MAXRECEIVEDLENGTH                                  STATEMACH_WORDA_MAXRECEIVEDLENGTH_Msk
#define STATEMACH_WORDB_PAPOWER_Pos                                        (0UL)
#define STATEMACH_WORDB_PAPOWER_Msk                                        (0x1fUL)
#define STATEMACH_WORDB_PAPOWER                                            STATEMACH_WORDB_PAPOWER_Msk
#if defined(STM32WB09)
#define STATEMACH_WORDB_TXHP_Pos                                           (7UL)
#define STATEMACH_WORDB_TXHP_Msk                                           (0x80UL)
#define STATEMACH_WORDB_TXHP                                               STATEMACH_WORDB_TXHP_Msk
#endif /* defined(STM32WB09) */
#define STATEMACH_WORDB_HOPINCR_Pos                                        (8UL)
#define STATEMACH_WORDB_HOPINCR_Msk                                        (0x3f00UL)
#define STATEMACH_WORDB_HOPINCR                                            STATEMACH_WORDB_HOPINCR_Msk
#define STATEMACH_WORDB_USEDCHANNELFLAGS_15_0_Pos                          (16UL)
#define STATEMACH_WORDB_USEDCHANNELFLAGS_15_0_Msk                          (0xffff0000UL)
#define STATEMACH_WORDB_USEDCHANNELFLAGS_15_0                              STATEMACH_WORDB_USEDCHANNELFLAGS_15_0_Msk
#define STATEMACH_WORDC_USEDCHANNELFLAGS_36_16_Pos                         (0UL)
#define STATEMACH_WORDC_USEDCHANNELFLAGS_36_16_Msk                         (0x3fffffUL)
#define STATEMACH_WORDC_USEDCHANNELFLAGS_36_16                             STATEMACH_WORDC_USEDCHANNELFLAGS_36_16_Msk
#define STATEMACH_WORDE_ENCRYPTIV_0_31_Pos                                 (0UL)
#define STATEMACH_WORDE_ENCRYPTIV_0_31_Msk                                 (0xffffffffUL)
#define STATEMACH_WORDE_ENCRYPTIV_0_31                                     STATEMACH_WORDE_ENCRYPTIV_0_31_Msk
#if defined(STM32WB05) || defined(STM32WB09)
#define STATEMACH_WORD14_AOD_NAOA_Pos                                      (0UL)
#define STATEMACH_WORD14_AOD_NAOA_Msk                                      (0x1UL)
#define STATEMACH_WORD14_AOD_NAOA                                          STATEMACH_WORD14_AOD_NAOA_Msk
#define STATEMACH_WORD14_CTESLOTWIDTH_Pos                                  (1UL)
#define STATEMACH_WORD14_CTESLOTWIDTH_Msk                                  (0x2UL)
#define STATEMACH_WORD14_CTESLOTWIDTH                                      STATEMACH_WORD14_CTESLOTWIDTH_Msk
#define STATEMACH_WORD14_CTETIME_Pos                                       (2UL)
#define STATEMACH_WORD14_CTETIME_Msk                                       (0x7cUL)
#define STATEMACH_WORD14_CTETIME                                           STATEMACH_WORD14_CTETIME_Msk
#define STATEMACH_WORD14_MAXIMUMIQSAMPLESNUMBER_Pos                        (8UL)
#define STATEMACH_WORD14_MAXIMUMIQSAMPLESNUMBER_Msk                        (0x7f00UL)
#define STATEMACH_WORD14_MAXIMUMIQSAMPLESNUMBER                            STATEMACH_WORD14_MAXIMUMIQSAMPLESNUMBER_Msk
#define STATEMACH_WORD14_ANTENNAPATTERNLENGTH_Pos                          (16UL)
#define STATEMACH_WORD14_ANTENNAPATTERNLENGTH_Msk                          (0xff0000UL)
#define STATEMACH_WORD14_ANTENNAPATTERNLENGTH                              STATEMACH_WORD14_ANTENNAPATTERNLENGTH_Msk
#define STATEMACH_WORD15_IQSAMPLESPTR_Pos                                  (0UL)
#define STATEMACH_WORD15_IQSAMPLESPTR_Msk                                  (0xffffffffUL)
#define STATEMACH_WORD15_IQSAMPLESPTR                                      STATEMACH_WORD15_IQSAMPLESPTR_Msk
#define STATEMACH_WORD16_ANTENNAPATTERNPTR_Pos                             (0UL)
#define STATEMACH_WORD16_ANTENNAPATTERNPTR_Msk                             (0xffffffffUL)
#define STATEMACH_WORD16_ANTENNAPATTERNPTR                                 STATEMACH_WORD16_ANTENNAPATTERNPTR_Msk
#endif /* defined(STM32WB05) || defined(STM32WB09) */


#define STATEMACH_BYTE0_UCHAN_Msk                                          (0x3F)
#define STATEMACH_BYTE0_RADIOCOMLISTENA_Msk                                (0x40)
#define STATEMACH_BYTE0_TXMODE_Msk                                         (0x80)

#define STATEMACH_BYTE1_REMAP_CHAN_Msk                                     (0x3F)
#define STATEMACH_BYTE1_SN_Msk                                             (0x40)
#define STATEMACH_BYTE1_NESN_Msk                                           (0x80)

#define STATEMACH_BYTE2_SEMAPRIO_Msk                                       (0x07)
#define STATEMACH_BYTE2_SEMAPREEMPT_Msk                                    (0x08)
#define STATEMACH_BYTE2_BUFFER_FULL_Msk                                    (0x10)
#define STATEMACH_BYTE2_ENCRYPTON_Msk                                      (0x20)
#define STATEMACH_BYTE2_TXENC_Msk                                          (0x40)
#define STATEMACH_BYTE2_RCVENC_Msk                                         (0x80)

#define STATEMACH_BYTE3_TXPHY_Msk                                          (0x07)

#if defined(STM32WB05) || defined(STM32WB09)
#define STATEMACH_BYTE3_CTEDISABLE_Msk                                     (0x08)
#endif /* defined(STM32WB05) || defined(STM32WB09) */

