stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_radio.h
#define STATEMACH_BYTE3_RXPHY_Msk                                          (0x70)

#define STATEMACH_BYTE34_PREAMBLEREP_Msk                                   (0x0F)
#define STATEMACH_BYTE34_ENAPREAMBLEREP_Msk                                (0x10)
#define STATEMACH_BYTE34_DISABLECRC_Msk                                    (0x20)
#define STATEMACH_BYTE34_MSBFIRST_Msk                                      (0x40)
#define STATEMACH_BYTE34_RXMICDBG_Msk                                      (0x80)

#define STATEMACH_BYTE35_INTTXERROR_Msk                                    (0x1F)
#define STATEMACH_BYTE35_INTENCERROR_Msk                                   (0x20)
#define STATEMACH_BYTE35_INTRXOVERFLOWERROR_Msk                            (0x40)
#define STATEMACH_BYTE35_RXDEBUGCRC_Msk                                    (0x80)

#if defined(STM32WB05) || defined(STM32WB09)
#define STATEMACH_BYTE80_AOD_NAOA_Msk                                      (0x01)
#define STATEMACH_BYTE80_CTESLOTWIDTH_Msk                                  (0x02)
#define STATEMACH_BYTE80_AOD_CTETIME_Msk                                   (0x7C)
#endif /* defined(STM32WB05) || defined(STM32WB09) */

/**
  * @}
  */

/** @defgroup TxRxPack_Masks TxRxPack Masks
  * @{
  */

#define TXRXPACK_WORD0_NEXTPTR_Pos                                         (0UL)
#define TXRXPACK_WORD0_NEXTPTR_Msk                                         (0xffffffffUL)
#define TXRXPACK_WORD0_NEXTPTR                                             TXRXPACK_WORD0_NEXTPTR_Msk
#define TXRXPACK_WORD1_CALREQ_Pos                                          (0UL)
#define TXRXPACK_WORD1_CALREQ_Msk                                          (0x1UL)
#define TXRXPACK_WORD1_CALREQ                                              TXRXPACK_WORD1_CALREQ_Msk
#define TXRXPACK_WORD1_KEEPSEMAREQ_Pos                                     (2UL)
#define TXRXPACK_WORD1_KEEPSEMAREQ_Msk                                     (0x4UL)
#define TXRXPACK_WORD1_KEEPSEMAREQ                                         TXRXPACK_WORD1_KEEPSEMAREQ_Msk
#if defined (STM32WB06) || defined (STM32WB07)
#define TXRXPACK_WORD1_SUPPENA_Pos                                        (3UL)
#define TXRXPACK_WORD1_SUPPENA_Msk                                        (0x8UL)
#define TXRXPACK_WORD1_SUPPENA                                            TXRXPACK_WORD1_SUPPENA_Msk
#endif /* defined (STM32WB06) || defined (STM32WB07) */
#if defined(STM32WB05) || defined(STM32WB09)
#define TXRXPACK_WORD1_CTEANDSAMPLINGENABLE_Pos                           (3UL)
#define TXRXPACK_WORD1_CTEANDSAMPLINGENABLE_Msk                           (0x8UL)
#define TXRXPACK_WORD1_CTEANDSAMPLINGENABLE                               TXRXPACK_WORD1_CTEANDSAMPLINGENABLE_Msk
#endif /* defined(STM32WB05) || defined(STM32WB09) */
#define TXRXPACK_WORD1_CRCINITSEL_Pos                                      (4UL)
#define TXRXPACK_WORD1_CRCINITSEL_Msk                                      (0x10UL)
#define TXRXPACK_WORD1_CRCINITSEL                                          TXRXPACK_WORD1_CRCINITSEL_Msk
#define TXRXPACK_WORD1_ADVERTISE_Pos                                       (5UL)
#define TXRXPACK_WORD1_ADVERTISE_Msk                                       (0x20UL)
#define TXRXPACK_WORD1_ADVERTISE                                           TXRXPACK_WORD1_ADVERTISE_Msk
#define TXRXPACK_WORD1_SN_EN_Pos                                           (6UL)
#define TXRXPACK_WORD1_SN_EN_Msk                                           (0x40UL)
#define TXRXPACK_WORD1_SN_EN                                               TXRXPACK_WORD1_SN_EN_Msk
#define TXRXPACK_WORD1_INCCHAN_Pos                                         (7UL)
#define TXRXPACK_WORD1_INCCHAN_Msk                                         (0x80UL)
#define TXRXPACK_WORD1_INCCHAN                                             TXRXPACK_WORD1_INCCHAN_Msk
#define TXRXPACK_WORD1_NEXTTXMODE_Pos                                      (8UL)
#define TXRXPACK_WORD1_NEXTTXMODE_Msk                                      (0x100UL)
#define TXRXPACK_WORD1_NEXTTXMODE                                          TXRXPACK_WORD1_NEXTTXMODE_Msk
#define TXRXPACK_WORD1_ALLTABLEREADY_Pos                                   (9UL)
#define TXRXPACK_WORD1_ALLTABLEREADY_Msk                                   (0x200UL)
#define TXRXPACK_WORD1_ALLTABLEREADY                                       TXRXPACK_WORD1_ALLTABLEREADY_Msk
#define TXRXPACK_WORD1_TXDATAREADY_Pos                                     (10UL)
#define TXRXPACK_WORD1_TXDATAREADY_Msk                                     (0x400UL)
#define TXRXPACK_WORD1_TXDATAREADY                                         TXRXPACK_WORD1_TXDATAREADY_Msk
#define TXRXPACK_WORD1_DISABLEWHITENING_Pos                                (12UL)
#define TXRXPACK_WORD1_DISABLEWHITENING_Msk                                (0x1000UL)
#define TXRXPACK_WORD1_DISABLEWHITENING                                    TXRXPACK_WORD1_DISABLEWHITENING_Msk
#define TXRXPACK_WORD2_DATAPTR_Pos                                         (0UL)
#define TXRXPACK_WORD2_DATAPTR_Msk                                         (0xffffffffUL)
#define TXRXPACK_WORD2_DATAPTR                                             TXRXPACK_WORD2_DATAPTR_Msk
#define TXRXPACK_WORD3_TIMER2_Pos                                          (0UL)
#define TXRXPACK_WORD3_TIMER2_Msk                                          (0xfffffUL)
#define TXRXPACK_WORD3_TIMER2                                              TXRXPACK_WORD3_TIMER2_Msk
#define TXRXPACK_WORD3_TIMER2EN_Pos                                        (20UL)
#define TXRXPACK_WORD3_TIMER2EN_Msk                                        (0x100000UL)
#define TXRXPACK_WORD3_TIMER2EN                                            TXRXPACK_WORD3_TIMER2EN_Msk
#define TXRXPACK_WORD3_TRIGRCV_Pos                                         (22UL)
#define TXRXPACK_WORD3_TRIGRCV_Msk                                         (0x400000UL)
#define TXRXPACK_WORD3_TRIGRCV                                             TXRXPACK_WORD3_TRIGRCV_Msk
#define TXRXPACK_WORD3_TRIGDONE_Pos                                        (23UL)
#define TXRXPACK_WORD3_TRIGDONE_Msk                                        (0x800000UL)
#define TXRXPACK_WORD3_TRIGDONE                                            TXRXPACK_WORD3_TRIGDONE_Msk
#define TXRXPACK_WORD3_INTTXOK_Pos                                         (24UL)
#define TXRXPACK_WORD3_INTTXOK_Msk                                         (0x1000000UL)
#define TXRXPACK_WORD3_INTTXOK                                             TXRXPACK_WORD3_INTTXOK_Msk
#define TXRXPACK_WORD3_INTDONE_Pos                                         (25UL)
#define TXRXPACK_WORD3_INTDONE_Msk                                         (0x2000000UL)
#define TXRXPACK_WORD3_INTDONE                                             TXRXPACK_WORD3_INTDONE_Msk
#define TXRXPACK_WORD3_INTRCVTIMEOUT_Pos                                   (26UL)
#define TXRXPACK_WORD3_INTRCVTIMEOUT_Msk                                   (0x4000000UL)
#define TXRXPACK_WORD3_INTRCVTIMEOUT                                       TXRXPACK_WORD3_INTRCVTIMEOUT_Msk
#define TXRXPACK_WORD3_INTTIMECAPTURE_Pos                                  (29UL)
#define TXRXPACK_WORD3_INTTIMECAPTURE_Msk                                  (0x20000000UL)
#define TXRXPACK_WORD3_INTTIMECAPTURE                                      TXRXPACK_WORD3_INTTIMECAPTURE_Msk
#define TXRXPACK_WORD3_INTRCVCRCERR_Pos                                    (30UL)
#define TXRXPACK_WORD3_INTRCVCRCERR_Msk                                    (0x40000000UL)
#define TXRXPACK_WORD3_INTRCVCRCERR                                        TXRXPACK_WORD3_INTRCVCRCERR_Msk
#define TXRXPACK_WORD3_INTRCVOK_Pos                                        (31UL)
#define TXRXPACK_WORD3_INTRCVOK_Msk                                        (0x80000000UL)
#define TXRXPACK_WORD3_INTRCVOK                                            TXRXPACK_WORD3_INTRCVOK_Msk

#define TXRXPACK_BYTE4_CALREQ_Msk                                          (0x01)
#define TXRXPACK_BYTE4_CHANALGO2SEL_Msk                                    (0x02)
#define TXRXPACK_BYTE4_KEEPSEMAREQ_Msk                                     (0x04)
#if defined(STM32WB05) || defined(STM32WB09)
#define TXRXPACK_BYTE4_CTEANDSAMPLINGENABLE_Msk                            (0x08)
#endif /* defined(STM32WB05) || defined(STM32WB09) */
#if defined(STM32WB06) || defined (STM32WB07)
#define TXRXPACK_BYTE4_SUPPENA_Msk                                         (0x08)
#endif /* defined(STM32WB06) || defined (STM32WB07) */
#define TXRXPACK_BYTE4_CRCINITSEL_Msk                                      (0x10)
#define TXRXPACK_BYTE4_ADVERTISE_Msk                                       (0x20)
#define TXRXPACK_BYTE4_SN_EN_Msk                                           (0x40)
#define TXRXPACK_BYTE4_INCCHAN_Msk                                         (0x80)

#define TXRXPACK_BYTE5_NEXTTXMODE_Msk                                      (0x01)
#define TXRXPACK_BYTE5_ALLTABLEREADY_Msk                                   (0x02)
#define TXRXPACK_BYTE5_TXDATAREADY_Msk                                     (0x04)
#define TXRXPACK_BYTE5_DATAREADYSEL_Msk                                    (0x08)
#define TXRXPACK_BYTE5_DISABLEWHITENING_Msk                                (0x10)
#define TXRXPACK_BYTE5_TESTPACKET_Msk                                      (0x20)

#if defined(STM32WB05) || defined(STM32WB09)
#define TXRXPACK_BYTE5_RTTPACKET_Msk                                       (0x40)
#define TXRXPACK_BYTE5_SQTEPACKET_Msk                                      (0x80)
#endif /* defined(STM32WB05) || defined(STM32WB09) */

#define TXRXPACK_BYTE14_TIMER2_19_16_Msk                                   (0x0F)
#define TXRXPACK_BYTE14_TIMER2EN_Msk                                       (0x10)
#define TXRXPACK_BYTE14_TRIGRCV_Msk                                        (0x40)
#define TXRXPACK_BYTE14_TRIGDONE_Msk                                       (0x80)

#define TXRXPACK_BYTE15_INTTXOK_Msk                                        (0x01)
#define TXRXPACK_BYTE15_INTDONE_Msk                                        (0x02)
#define TXRXPACK_BYTE15_INTRCVTIMEOUT_Msk                                  (0x04)
#define TXRXPACK_BYTE15_INTRCVNOMD_Msk                                     (0x08)
#define TXRXPACK_BYTE15_INTRCVCMD_Msk                                      (0x10)
#define TXRXPACK_BYTE15_INTRCVTRIG_Msk                                     (0x20)
#define TXRXPACK_BYTE15_INTRCVCRCERR_Msk                                   (0x40)
#define TXRXPACK_BYTE15_INTRCVOK_Msk                                       (0x80)
#define TXRXPACK_BYTE15_INT_EN_Msk                                         (0xFF)

/**
  * @}
  */


#define MAX_LL_PACKET_LENGTH    255 /* Maximum Link Layer Packet Length (user_payload + MIC)*/
#define MAX_OUTPUT_RF_POWER     0x1F

#define HEADER_LENGTH           2
#define MAX_PACKET_LENGTH       (MAX_LL_PACKET_LENGTH+HEADER_LENGTH)
#define MIC_FIELD_LENGTH        4
#define SUCCESS_0               0
#define INVALID_PARAMETER_C0    0xC0
#define RADIO_BUSY_C4           0xC4
#define NULL_0                  0
#define BLUE_IDLE_0             0
#define TIMESTAMP_POSITION_ACCESSADDRESS    0x40
#define TIMESTAMP_POSITION_LASTBIT          0x80
#define BACK_TO_BACK_TIME       150 /* BLE IFS equal to 150 micro second */


/** @defgroup PHY PHY selection
  * @{
  */

