stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_radio.h
#define PHY_1M 0x00
#define PHY_2M 0x01
#define PHY_CODED_S_8 0x04
#define PHY_CODED_S_2 0x06

/**
  * @}
  */


/** @defgroup ActionTag_BitMask ActionTag BitMask
  * @{
  */

/* This bit activates the radio frequency PLL calibration.
 * 0: Radio frequency calibration disabled.
 * 1: Radio frequency calibration enabled.
*/
#define PLL_TRIG                    0x01

/* This bit determines if the action is an RX action or a TX action.
 * 1: TX
 * 0: RX
*/
#define TXRX                        0x02

/* The bit determines if the action (RX or TX) is going to be executed based on the back-to-back time or based on the WakeupTime.
 * 0: Based on the back-to-back time (default 150 us).
 * 1: Based on the WakeupTime.
*/
#define TIMER_WAKEUP                0x04

/* The bit determines if whitening is disabled or not.
 *0: The whitening is enabled in the transmit block and in the receive block.
 *1: The whitening is disabled in the transmit block and in the receive block.
*/
#define WHITENING_DISABLE           0x10

/* It determines if the WakeupTime field of the ActionPacket is considered as absolute time or relative time to the current.
 * 0: Absolute
 * 1: Relative
*/
#define RELATIVE                    0x20

/* This bit sets where the position of time stamp is taken, the beginning of the packet or the end of it. RX only.
 * 0: End of the Packet
 * 1: Beginning of the packet
 */
#define TIMESTAMP_POSITION          0x40

/* This bit activates automatic channel increment. The API HAL_RADIO_SetChannel sets the value of the increment.
 * 0: No increment
 * 1: Automatic increment
*/
#define INC_CHAN                    0x80


/**
  * @}
  */

/**
  * @}
  */

/** @defgroup RADIO_Exported_Types RADIO Exported Types
  * @{
  */

/**
  * @brief Radio Global State Machine Word oriented description
  */

typedef struct
{
  volatile uint32_t  WORD0;
  volatile uint32_t  WORD1;
  volatile uint32_t  WORD2;
  volatile uint32_t  WORD3;
  volatile uint32_t  WORD4;
  volatile uint32_t  WORD5;
  volatile uint32_t  WORD6;
} GLOBALSTATMACH_WORD_TypeDef;


/**
  * @brief Radio Link State Machine Word oriented description
  */
#if defined(STM32WB05) || defined(STM32WB09)
typedef struct
{
  volatile uint32_t  WORD0;
  volatile uint32_t  WORD1;
  volatile uint32_t  WORD2;
  volatile uint32_t  WORD3;
  volatile uint32_t  WORD4;
  volatile uint32_t  WORD5;
  volatile uint32_t  WORD6;
  volatile uint32_t  WORD7;
  volatile uint32_t  WORD8;
  volatile uint32_t  WORD9;
  volatile uint32_t  WORDA;
  volatile uint32_t  WORDB;
  volatile uint32_t  WORDC;
  volatile uint32_t  WORDD;
  volatile uint32_t  WORDE;
  volatile uint32_t  WORDF;
  volatile uint32_t WORD10;
  volatile uint32_t WORD11;
  volatile uint32_t WORD12;
  volatile uint32_t WORD13;
  volatile uint32_t WORD14;
  volatile uint32_t WORD15;
  volatile uint32_t WORD16;
} STATMACH_WORD_TypeDef;
#endif /* defined(STM32WB05) || defined(STM32WB09) */
#if defined (STM32WB06) || defined (STM32WB07)
typedef struct
{
  volatile uint32_t  WORD0;
  volatile uint32_t  WORD1;
  volatile uint32_t  WORD2;
  volatile uint32_t  WORD3;
  volatile uint32_t  WORD4;
  volatile uint32_t  WORD5;
  volatile uint32_t  WORD6;
  volatile uint32_t  WORD7;
  volatile uint32_t  WORD8;
  volatile uint32_t  WORD9;
  volatile uint32_t  WORDA;
  volatile uint32_t  WORDB;
  volatile uint32_t  WORDC;
  volatile uint32_t  WORDD;
  volatile uint32_t  WORDE;
  volatile uint32_t  WORDF;
  volatile uint32_t WORD10;
  volatile uint32_t WORD11;
  volatile uint32_t WORD12;
  volatile uint32_t WORD13;
} STATMACH_WORD_TypeDef;
#endif /* defined (STM32WB06) || defined (STM32WB07) */


/**
  * @brief Radio TxRxPack Word oriented description
  */
#if defined(STM32WB05) || defined(STM32WB09)
typedef struct
{
  volatile uint32_t WORD0;
  volatile uint32_t WORD1;
  volatile uint32_t WORD2;
  volatile uint32_t WORD3;
} TXRXPACK_WORD_TypeDef;
#endif /* defined(STM32WB05) || defined(STM32WB09) */
#if defined (STM32WB06) || defined (STM32WB07)
typedef struct
{
  volatile uint32_t WORD0;
  volatile uint32_t WORD1;
  volatile uint32_t WORD2;
  volatile uint32_t WORD3;
  volatile uint32_t WORD4;
} TXRXPACK_WORD_TypeDef;
#endif /* defined (STM32WB06) || defined (STM32WB07) */


#if defined(STM32WB05) || defined(STM32WB09)

/**
  * @brief Radio Global State Machine description
  */

typedef struct
{
  volatile uint32_t RADIOCONFIGPTR;
  volatile uint8_t BYTE4;
  volatile uint8_t WAKEUPINITDELAY;
  volatile uint8_t TIMER12INITDELAYCAL;
  volatile uint8_t TIMER2INITDELAYNOCAL;
  volatile uint8_t TRANSMITCALDELAYCHK;
  volatile uint8_t TRANSMITNOCALDELAYCHK;
  volatile uint8_t RECEIVECALDELAYCHK;
  volatile uint8_t RECEIVENOCALDELAYCHK;
  volatile uint8_t CONFIGENDDURATION;
  volatile uint8_t TXDATAREADYCHECK;
  volatile uint8_t TXDELAYSTART;
  volatile uint8_t BYTE15;
  volatile uint8_t TXREADYTIMEOUT;
  volatile uint8_t RCVTIMEOUT[3];
  volatile uint8_t BYTE20;
  volatile uint8_t BYTE21;
  volatile uint8_t BYTE22;
  volatile uint8_t BYTE23;
  volatile uint8_t DEFAULTANTENNAID;
  volatile uint8_t RESERVED[3];
} GLOBALSTATMACH_TypeDef;

/**
  * @brief Radio Link State Machine description
  */

typedef struct
{
  volatile uint8_t BYTE0;
  volatile uint8_t BYTE1;
  volatile uint8_t BYTE2;
  volatile uint8_t BYTE3;
  volatile uint32_t TXPOINT;
  volatile uint32_t RCVPOINT;
  volatile uint32_t TXPOINTPREV;
  volatile uint32_t RCVPOINTPREV;
  volatile uint32_t TXPOINTNEXT;
  volatile uint8_t PCNTTX[5];
  volatile uint8_t PCNTRCV[5];
  volatile uint8_t BYTE34;
  volatile uint8_t BYTE35;
  volatile uint32_t ACCADDR;
  volatile uint8_t CRCINIT[3];
  volatile uint8_t MAXRECEIVEDLENGTH;
  volatile uint8_t PAPOWER;
  volatile uint8_t HOPINCR;
  volatile uint8_t USEDCHANNELFLAGS[5];
  volatile uint8_t RESERVED;
  volatile uint16_t CONNEVENTCOUNTER;
  volatile uint16_t PAEVENTCOUNTER;
  volatile uint8_t ENCRYPTIV[8];
  volatile uint8_t ENCRYPTK[16];
  volatile uint8_t BYTE80;
  volatile uint8_t MAXIQSAMPLESNUMBER;
  volatile uint8_t ANTENNAPATTERNLENGTH;
  volatile uint8_t SQTIME;
  volatile uint32_t IQSAMPLESPTR;
  volatile uint32_t ANTENNAPATTERNPTR;
} STATMACH_TypeDef;

/**
  * @brief Radio TxRxPack description
  */

typedef struct
{
  volatile uint32_t NEXTPTR;
  volatile uint8_t  BYTE4;
  volatile uint8_t  BYTE5;
  volatile uint16_t RESERVED;
  volatile uint32_t DATAPTR;
  volatile uint8_t TIMER2[2];
  volatile uint8_t BYTE14;
  volatile uint8_t BYTE15;
} TXRXPACK_TypeDef;

#endif /* defined(STM32WB05) || defined(STM32WB09) */

