stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_radio.h
#ifdef STATEMACH_WORD14_CTESLOTWIDTH
/**
  * @brief
  * @note
  * @rmtoll WORD14          CTESLOTWIDTH       LL_RADIO_SetCTESlotWidth
  * @param  stateMachineNo
  * @param  value
  * @retval None
  */
__STATIC_INLINE void LL_RADIO_SetCTESlotWidth(uint8_t stateMachineNo, uint32_t value)
{
  MODIFY_REG_FIELD((BLUEDATAWORD + stateMachineNo)->WORD14, STATEMACH_WORD14_CTESLOTWIDTH, value);
}

/**
  * @brief
  * @note
  * @rmtoll WORD14          CTESLOTWIDTH       LL_RADIO_GetCTESlotWidth
  * @param  stateMachineNo
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_GetCTESlotWidth(uint8_t stateMachineNo)
{
  return (uint32_t)(READ_BIT((BLUEDATAWORD + stateMachineNo)->WORD14,
                             STATEMACH_WORD14_CTESLOTWIDTH) >> STATEMACH_WORD14_CTESLOTWIDTH_Pos);
}
#endif /* STATEMACH_WORD14_CTESLOTWIDTH */

#ifdef STATEMACH_WORD14_MAXIMUMIQSAMPLESNUMBER
/**
  * @brief
  * @note
  * @rmtoll WORD14          MAXIMUMIQSAMPLESNUMBER       LL_RADIO_SetMaximumIQSamplesNumber
  * @param  stateMachineNo
  * @param  value
  * @retval None
  */
__STATIC_INLINE void LL_RADIO_SetMaximumIQSamplesNumber(uint8_t stateMachineNo, uint32_t value)
{
  MODIFY_REG_FIELD((BLUEDATAWORD + stateMachineNo)->WORD14, STATEMACH_WORD14_MAXIMUMIQSAMPLESNUMBER, value);
}

/**
  * @brief
  * @note
  * @rmtoll WORD14          MAXIMUMIQSAMPLESNUMBER       LL_RADIO_GetMaximumIQSamplesNumber
  * @param  stateMachineNo
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_GetMaximumIQSamplesNumber(uint8_t stateMachineNo)
{
  return (uint32_t)(READ_BIT((BLUEDATAWORD + stateMachineNo)->WORD14,
                             STATEMACH_WORD14_MAXIMUMIQSAMPLESNUMBER) >> STATEMACH_WORD14_MAXIMUMIQSAMPLESNUMBER_Pos);
}
#endif /* STATEMACH_WORD14_MAXIMUMIQSAMPLESNUMBER */

#ifdef STATEMACH_WORD14_ANTENNAPATTERNLENGTH
/**
  * @brief
  * @note
  * @rmtoll WORD14          ANTENNAPATTERNLENGTH       LL_RADIO_SetAntennaPatternLength
  * @param  stateMachineNo
  * @param  value
  * @retval None
  */
__STATIC_INLINE void LL_RADIO_SetAntennaPatternLength(uint8_t stateMachineNo, uint32_t value)
{
  MODIFY_REG_FIELD((BLUEDATAWORD + stateMachineNo)->WORD14, STATEMACH_WORD14_ANTENNAPATTERNLENGTH, value);
}

/**
  * @brief
  * @note
  * @rmtoll WORD14          ANTENNAPATTERNLENGTH       LL_RADIO_GetAntennaPatternLength
  * @param  stateMachineNo
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_GetAntennaPatternLength(uint8_t stateMachineNo)
{
  return (uint32_t)(READ_BIT((BLUEDATAWORD + stateMachineNo)->WORD14,
                             STATEMACH_WORD14_ANTENNAPATTERNLENGTH) >> STATEMACH_WORD14_ANTENNAPATTERNLENGTH_Pos);
}
#endif /* STATEMACH_WORD14_ANTENNAPATTERNLENGTH */

#ifdef STATEMACH_WORD15_IQSAMPLESPTR
/**
  * @brief
  * @note
  * @rmtoll WORD15          IQSAMPLESPTR       LL_RADIO_SetIQSamplesPtr
  * @param  stateMachineNo
  * @param  value
  * @retval None
  */
__STATIC_INLINE void LL_RADIO_SetIQSamplesPtr(uint8_t stateMachineNo, uint32_t value)
{
  MODIFY_REG_FIELD((BLUEDATAWORD + stateMachineNo)->WORD15, STATEMACH_WORD15_IQSAMPLESPTR, value);
}

/**
  * @brief
  * @note
  * @rmtoll WORD15          IQSAMPLESPTR       LL_RADIO_GetIQSamplesPtr
  * @param  stateMachineNo
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_GetIQSamplesPtr(uint8_t stateMachineNo)
{
  return (uint32_t)(READ_BIT((BLUEDATAWORD + stateMachineNo)->WORD15,
                             STATEMACH_WORD15_IQSAMPLESPTR) >> STATEMACH_WORD15_IQSAMPLESPTR_Pos);
}
#endif /* STATEMACH_WORD15_IQSAMPLESPTR */

#ifdef STATEMACH_WORD16_ANTENNAPATTERNPTR
/**
  * @brief
  * @note
  * @rmtoll WORD16          ANTENNAPATTERNPTR       LL_RADIO_SetAntennaPatternPtr
  * @param  value
  * @retval None
  */
__STATIC_INLINE void LL_RADIO_SetAntennaPatternPtr(uint8_t stateMachineNo, uint32_t value)
{
  MODIFY_REG_FIELD((BLUEDATAWORD + stateMachineNo)->WORD16, STATEMACH_WORD16_ANTENNAPATTERNPTR, value);
}

/**
  * @brief
  * @note
  * @rmtoll WORD16          ANTENNAPATTERNPTR       LL_RADIO_GetAntennaPatternPtr
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_GetAntennaPatternPtr(uint8_t stateMachineNo)
{
  return (uint32_t)(READ_BIT((BLUEDATAWORD + stateMachineNo)->WORD16,
                             STATEMACH_WORD16_ANTENNAPATTERNPTR) >> STATEMACH_WORD16_ANTENNAPATTERNPTR_Pos);
}

#endif /* STATEMACH_WORD16_ANTENNAPATTERNPTR */


/**
  * @brief
  * @note
  * @rmtoll WORD0          NEXTPTR       LL_RADIO_SetNextPointer
  * @param  p RADIO Instance
  * @param  value
  * @retval None
  */
__STATIC_INLINE void LL_RADIO_SetNextPointer(TXRXPACK_TypeDef *p, uint32_t value)
{
  MODIFY_REG_FIELD(((TXRXPACK_WORD_TypeDef *)p)->WORD0, TXRXPACK_WORD0_NEXTPTR, value);
}

/**
  * @brief
  * @note
  * @rmtoll WORD0          NEXTPTR       LL_RADIO_GetNextPointer
  * @param  p RADIO Instance
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_GetNextPointer(TXRXPACK_TypeDef *p)
{
  return (uint32_t)(READ_BIT(((TXRXPACK_WORD_TypeDef *)p)->WORD0, TXRXPACK_WORD0_NEXTPTR) >> TXRXPACK_WORD0_NEXTPTR_Pos);
}

/**
  * @brief
  * @note
  * @rmtoll WORD1          CALREQ       LL_RADIO_SetCalibrationRequest
  * @param  p RADIO Instance
  * @param  value
  * @retval None
  */
__STATIC_INLINE void LL_RADIO_SetCalibrationRequest(TXRXPACK_TypeDef *p, uint32_t value)
{
  MODIFY_REG_FIELD(((TXRXPACK_WORD_TypeDef *)p)->WORD1, TXRXPACK_WORD1_CALREQ, value);
}

/**
  * @brief
  * @note
  * @rmtoll WORD1          CALREQ       LL_RADIO_GetCalibrationRequest
  * @param  p RADIO Instance
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_GetCalibrationRequest(TXRXPACK_TypeDef *p)
{
  return (uint32_t)(READ_BIT(((TXRXPACK_WORD_TypeDef *)p)->WORD1, TXRXPACK_WORD1_CALREQ) >> TXRXPACK_WORD1_CALREQ_Pos);
}

/**
  * @brief
  * @note
  * @rmtoll WORD1          KEEPSEMAREQ       LL_RADIO_SetKeepSemaRequest
  * @param  p RADIO Instance
  * @param  value
  * @retval None
  */
__STATIC_INLINE void LL_RADIO_SetKeepSemaRequest(TXRXPACK_TypeDef *p, uint32_t value)
{
  MODIFY_REG_FIELD(((TXRXPACK_WORD_TypeDef *)p)->WORD1, TXRXPACK_WORD1_KEEPSEMAREQ, value);
}

/**
  * @brief
  * @note
  * @rmtoll WORD1          KEEPSEMAREQ       LL_RADIO_GetKeepSemaRequest
  * @param  p RADIO Instance
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_GetKeepSemaRequest(TXRXPACK_TypeDef *p)
{
  return (uint32_t)(READ_BIT(((TXRXPACK_WORD_TypeDef *)p)->WORD1,
                             TXRXPACK_WORD1_KEEPSEMAREQ) >> TXRXPACK_WORD1_KEEPSEMAREQ_Pos);
}

