stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_radio.h
#ifdef BLUE_CONTROLLERVERNUMREG_SUBVERNUM
/**
  * @brief
  * @note
  * @rmtoll CONTROLLERVERNUMREG          SUBVERNUM       LL_RADIO_BlueGetSubversionNumber
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_BlueGetSubversionNumber(void)
{
  return (uint32_t)(READ_BIT(BLUE->CONTROLLERVERNUMREG,
                             BLUE_CONTROLLERVERNUMREG_SUBVERNUM) >> BLUE_CONTROLLERVERNUMREG_SUBVERNUM_Pos);
}
#endif /* BLUE_CONTROLLERVERNUMREG_SUBVERNUM */

#ifdef BLUE_CONTROLLERVERNUMREG_VERNUM
/**
  * @brief
  * @note
  * @rmtoll CONTROLLERVERNUMREG          VERNUM       LL_RADIO_BlueGetVersionNumber
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_BlueGetVersionNumber(void)
{
  return (uint32_t)(READ_BIT(BLUE->CONTROLLERVERNUMREG,
                             BLUE_CONTROLLERVERNUMREG_VERNUM) >> BLUE_CONTROLLERVERNUMREG_VERNUM_Pos);
}
#endif /* BLUE_CONTROLLERVERNUMREG_VERNUM */

#ifdef BLUE_CONTROLLERVERNUMREG_TYP
/**
  * @brief
  * @note
  * @rmtoll CONTROLLERVERNUMREG          TYP       LL_RADIO_BlueGetBLEControllerTypeNumber
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_BlueGetBLEControllerTypeNumber(void)
{
  return (uint32_t)(READ_BIT(BLUE->CONTROLLERVERNUMREG,
                             BLUE_CONTROLLERVERNUMREG_TYP) >> BLUE_CONTROLLERVERNUMREG_TYP_Pos);
}
#endif /* BLUE_CONTROLLERVERNUMREG_TYP */

#ifdef BLUE_INTERRUPT1REG_ALL
/**
  * @brief
  * @note
  * @rmtoll INTERRUPT1REG          ALL       LL_RADIO_BlueSetInterrupt1RegRegister
  * @param  value
  * @retval None
  */
__STATIC_INLINE void LL_RADIO_BlueSetInterrupt1RegRegister(uint32_t value)
{
  MODIFY_REG_FIELD(BLUE->INTERRUPT1REG, BLUE_INTERRUPT1REG_ALL, value);
}

/**
  * @brief
  * @note
  * @rmtoll INTERRUPT1REG          ALL       LL_RADIO_BlueGetInterrupt1RegRegister
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_BlueGetInterrupt1RegRegister(void)
{
  return (uint32_t)(READ_BIT(BLUE->INTERRUPT1REG, BLUE_INTERRUPT1REG_ALL) >> BLUE_INTERRUPT1REG_ALL_Pos);
}
#endif /* BLUE_INTERRUPT1REG_ALL */

/**
  * @brief
  * @note
  * @rmtoll TIMERCAPTUREREG          TIMERCAPTURE       LL_RADIO_BlueGetTimerCapture
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_BlueGetTimerCapture(void)
{
  return (uint32_t)(READ_BIT(BLUE->TIMERCAPTUREREG,
                             BLUE_TIMERCAPTUREREG_TIMERCAPTURE) >> BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos);
}

/**
  * @brief
  * @note
  * @rmtoll CMDREG          CLEARSEMAREQ       LL_RADIO_BlueSetClearSemaphoreRequest
  * @param  value
  * @retval None
  */
__STATIC_INLINE void LL_RADIO_BlueSetClearSemaphoreRequest(uint32_t value)
{
  MODIFY_REG_FIELD(BLUE->CMDREG, BLUE_CMDREG_CLEARSEMAREQ, value);
}

/**
  * @brief
  * @note
  * @rmtoll CMDREG          CLEARSEMAREQ       LL_RADIO_BlueGetClearSemaphoreRequest
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_BlueGetClearSemaphoreRequest(void)
{
  return (uint32_t)(READ_BIT(BLUE->CMDREG, BLUE_CMDREG_CLEARSEMAREQ) >> BLUE_CMDREG_CLEARSEMAREQ_Pos);
}

/**
  * @brief
  * @note
  * @rmtoll CMDREG          BLUE_CMDREG_TXRXSKIP       LL_RADIO_BlueSetTxRxSkip
  * @param  value
  * @retval None
  */
__STATIC_INLINE void LL_RADIO_BlueSetTxRxSkip(uint32_t value)
{
  MODIFY_REG_FIELD(BLUE->CMDREG, BLUE_CMDREG_TXRXSKIP, value);
}

/**
  * @brief
  * @note
  * @rmtoll STATUSREG          ACTIVE2ERROR       LL_RADIO_BlueGetActive2Error
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_BlueGetActive2Error(void)
{
  return (uint32_t)(READ_BIT(BLUE->STATUSREG, BLUE_STATUSREG_ACTIVE2ERROR) >> BLUE_STATUSREG_ACTIVE2ERROR_Pos);
}

/**
  * @brief
  * @note
  * @rmtoll INTERRUPT1LATENCYREG          INTERRUPT1LATENCY       LL_RADIO_BlueGetInterrupt1Latency
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_BlueGetInterrupt1Latency(void)
{
  return (uint32_t)(READ_BIT(BLUE->INTERRUPT1LATENCYREG,
                             BLUE_INTERRUPT1LATENCYREG_INTERRUPT1LATENCY) >> BLUE_INTERRUPT1LATENCYREG_INTERRUPT1LATENCY_Pos);
}

/**
  * @brief
  * @note
  * @rmtoll MANAESKEY0REG          MANAESKEY_31_0       LL_RADIO_BlueSetManualAesKey_31_0
  * @param  value
  * @retval None
  */
__STATIC_INLINE void LL_RADIO_BlueSetManualAesKey_31_0(uint32_t value)
{
  MODIFY_REG_FIELD(BLUE->MANAESKEY0REG, BLUE_MANAESKEY0REG_MANAESKEY_31_0, value);
}

/**
  * @brief
  * @note
  * @rmtoll MANAESKEY0REG          MANAESKEY_31_0       LL_RADIO_BlueGetManualAesKey_31_0
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_BlueGetManualAesKey_31_0(void)
{
  return (uint32_t)(READ_BIT(BLUE->MANAESKEY0REG,
                             BLUE_MANAESKEY0REG_MANAESKEY_31_0) >> BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos);
}

/**
  * @brief
  * @note
  * @rmtoll MANAESCMDREG          START       LL_RADIO_BlueSetManAESCmdStart
  * @param  value
  * @retval None
  */
__STATIC_INLINE void LL_RADIO_BlueSetManAESCmdStart(uint32_t value)
{
  MODIFY_REG_FIELD(BLUE->MANAESCMDREG, BLUE_MANAESCMDREG_START, value);
}

/**
  * @brief
  * @note
  * @rmtoll MANAESCMDREG          START       LL_RADIO_BlueGetManAESCmdStart
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_BlueGetManAESCmdStart(void)
{
  return (uint32_t)(READ_BIT(BLUE->MANAESCMDREG, BLUE_MANAESCMDREG_START) >> BLUE_MANAESCMDREG_START_Pos);
}

/**
  * @brief
  * @note
  * @rmtoll MANAESSTATREG          BUSY       LL_RADIO_BlueGetManAESStatusBusy
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_BlueGetManAESStatusBusy(void)
{
  return (uint32_t)(READ_BIT(BLUE->MANAESSTATREG, BLUE_MANAESSTATREG_BUSY) >> BLUE_MANAESSTATREG_BUSY_Pos);
}

#ifdef BLUE_STATUS2REG_IQSAMPLES_READY
/**
  * @brief
  * @note
  * @rmtoll STATUS2REG          IQSAMPLES_READY       LL_RADIO_GetIQSamplesReady
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_GetIQSamplesReady(void)
{
  return (uint32_t)(READ_BIT(BLUE->STATUS2REG, BLUE_STATUS2REG_IQSAMPLES_READY) >> BLUE_STATUS2REG_IQSAMPLES_READY_Pos);
}
#endif /* BLUE_STATUS2REG_IQSAMPLES_READY */

#ifdef BLUE_STATUS2REG_IQSAMPLES_NUMBER
/**
  * @brief
  * @note
  * @rmtoll STATUS2REG          IQSAMPLES_NUMBER       LL_RADIO_GetIQSamplesNumber
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_GetIQSamplesNumber(void)
{
  return (uint32_t)(READ_BIT(BLUE->STATUS2REG, BLUE_STATUS2REG_IQSAMPLES_NUMBER) >> BLUE_STATUS2REG_IQSAMPLES_NUMBER_Pos);
}
#endif /* BLUE_STATUS2REG_IQSAMPLES_NUMBER */

