stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_ll_radio.h
#ifdef BLUE_STATUS2REG_IQSAMPLES_MISSING_ERROR
/**
  * @brief
  * @note
  * @rmtoll STATUS2REG          IQSAMPLES_MISSING_ERROR       LL_RADIO_GetIQSamplesMissingError
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_GetIQSamplesMissingError(void)
{
  return (uint32_t)(READ_BIT(BLUE->STATUS2REG,
                             BLUE_STATUS2REG_IQSAMPLES_MISSING_ERROR) >> BLUE_STATUS2REG_IQSAMPLES_MISSING_ERROR_Pos);
}
#endif /* BLUE_STATUS2REG_IQSAMPLES_MISSING_ERROR */

#ifdef BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ACCESS_ERROR
/**
  * @brief
  * @note
  * @rmtoll STATUS2REG          ANTENNA_SWITCHING_PATTERN_ACCESS_ERROR       LL_RADIO_GetAntennaSwitchingPatternAccessError
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_GetAntennaSwitchingPatternAccessError(void)
{
  return (uint32_t)(READ_BIT(BLUE->STATUS2REG,
                             BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ACCESS_ERROR) >> BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ACCESS_ERROR_Pos);
}
#endif /* BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ACCESS_ERROR */


#ifdef BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ADDRESS_ERROR
/**
  * @brief
  * @note
  * @rmtoll STATUS2REG          ANTENNA_SWITCHING_PATTERN_ADDRESS_ERROR       LL_RADIO_GetAntennaSwitchingPatternAddressError
  * @retval uint32_t
  */
__STATIC_INLINE uint32_t LL_RADIO_GetAntennaSwitchingPatternAddressError(void)
{
  return (uint32_t)(READ_BIT(BLUE->STATUS2REG,
                             BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ADDRESS_ERROR) >>
                    BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ADDRESS_ERROR_Pos);
}
#endif /* BLUE_STATUS2REG_ANTENNA_SWITCHING_PATTERN_ADDRESS_ERROR */


/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /*STM32WB0x_LL_RADIO_H */
